Лицензия MIT

Авторские права (c) 2026 Nikita21537

Настоящим предоставляется бесплатное разрешение любому лицу, получившему копию
этого программного обеспечения и связанных с ним файлов с документацией («Программное обеспечение»),
на использование, копирование, изменение, слияние, публикацию, распространение,
лицензирование и/или продажу копий Программного обеспечения, а также на
предоставление права на это лицам, которым Программное обеспечение
предоставлено, при соблюдении следующих условий:

Приведенное выше уведомление об авторских правах и данное разрешение должны быть включены во все копии или существенные части Программного обеспечения. 


ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ ГАРАНТИЙ, ВКЛЮЧАЯ, ПОМИМО ПРОЧЕГО, ГАРАНТИИ ТОВАРНОГО СОСТОЯНИЯ,
СООТВЕТСТВИЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ И НЕНАРУШЕНИЯ ПРАВ ПОЛЬЗОВАТЕЛЕЙ.  НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОРЫ ИЛИ ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ ПРЕТЕНЗИИ, УБЫТКИ ИЛИ ИНЫЕ
ОТВЕТСТВЕННОСТЬ, ЯВЛЯЮЩАЯСЯ РЕЗУЛЬТАТОМ ДОГОВОРА, ДЕЛИКТА ИЛИ ИНЫХ ПРАВОНАРУШЕНИЙ, ВОЗНИКШИХ В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ, ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ЕГО ИСПОЛЬЗОВАНИЕМ ИЛИ ИНЫМИ СДЕЛКАМИ, СВЯЗАННЫМИ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ.
